#### CustomExporter Members

---

|  |
| --- |
| CustomExporter Class   Constructors   Methods   Properties   See Also |

The  CustomExporter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | CustomExporter | Constructs a new instance of a CustomExporter for a given document using the input instance of IExportContext as the output device. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  CustomExporter |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | Export(IList ElementId ) | Exports a collection of 3D or 2D views |
| Public method | Export(View) | Exports one 3D or 2D view |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsRenderingSupported | Checks if view rendering is currently supported in the running instance of Revit. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Export2DForceDisplayStyle | This value tells the exporter of 2D views to force the given display mode for the view. |
| Public property | Export2DGeometricObjectsIncludingPatternLines | This flag sets the exporter of 2D views to either include or exclude output of face pattern lines as part of geometric objects when the model is being processed by the export context. |
| Public property | Export2DIncludingAnnotationObjects | This flag sets the exporter of 2D views to either include or exclude output of annotation objects when the model is being processed by the export context. |
| Public property | IncludeGeometricObjects | This flag sets the exporter to either include or exclude output of geometric objects such as faces and curves when the model is being processed by the export context. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ShouldStopOnError | This flag instructs the exporting process to either stop or continue in case an error occurs during any of the exporting methods. |

# See Also

CustomExporter Class

Autodesk.Revit.DB Namespace